:PROPERTIES:
:ID: 4E3F1039-7FDA-4263-81D5-296E935AACCE
:END:
#+title: Delete
#+description: Delete
#+type: recipe
#+version: 2
#+level: cross
#+filetags: :recipe:shell:change_reason_categories:
#+created: 2026-05-21
#+updated: 2026-05-21

Delete a change reason category by code.

#+name: change-reason-categories-delete
#+begin_src ores-shell :exports none
change-reason-categories delete TEST_CATEGORY
exit
#+end_src

#+begin_src sh :noweb yes :results output  :wrap example
export ORES_SHELL_LOGIN_PASSWORD
./ores.shell ${log_args} ${connect_args} ${login_args} << 'EOF'
<<change-reason-categories-delete>>
EOF
#+end_src

#+RESULTS:
#+begin_example
✓ Connected to :51004
✓ Logged in as: newuser3
ORE Studio Shell REPL v0.0.8
Type 'help' for available commands, 'exit' to quit.

ores-shell> ✓ Category TEST_CATEGORY deleted successfully!
ores-shell> Bye!
#+end_example
